from dotenv import load_dotenv
from langchain.chains.retrieval_qa.base import RetrievalQA
from langchain_openai.chat_models import ChatOpenAI
from langchain.vectorstores.chroma import Chroma
from langchain_openai import OpenAIEmbeddings
import langchain
from dotenv import load_dotenv
from langchain.prompts import PromptTemplate
from langchain_openai.chat_models import ChatOpenAI
from langchain.chains import LLMChain
langchain.debug = True

load_dotenv()


if __name__ == "__main__":
    # question = "누가 벌금을 가장 많이 냈어?"
    question = "선수별 특징 알려줘"
    llm = ChatOpenAI()
    embeddings = OpenAIEmbeddings()

    info = """System: Use the following pieces of context to answer the user's question.
규칙:
- 11점을 내면 경기 끝남.
- 진팀에서 0점이면 10000원, 1~3점이면 2000원, 4~6점이면 1000원을 벌금으로 냄
- 헤드샷(대가리샷)은 5점, 라켓샷은 10점, 넷트와 엣지가 동시에 되면 5명을 벌점으로 상대에게 줘야 함.
 
선수별 특징:
- 김상현: 탁구 칠때 점프를 많이 하고 헛스윙을 많이해서 가장 많이 해. 특히 스핀 많으면 100% 헛스윙. 가끔 노리개 역할도 정성스럽게 수행하지.
- 허동혁: 엄청 시끄럽고, 탁구보다 깐죽대는 걸 더 절해. 우기기 대마왕이라고 불리우는데, 탁구보다 우기기를 더 잘해.
- 김지훈: 기복이 심하고 특히 비오는 날 잘 맞아. 날씨에 따라 상현이한테 지기도 해. 가끔은 탁구장에서 테니스 치는거 같이 쳐. 
- 한경만: 펜홀더 보다 쉐이크를 더 잘하고, 치키타의 명수지. 공평성을 위해 가끔 승부조작도 함.
- 박은규: 김상현과 실력으로는 비등하지만 리액션이 짱이지. 매 시즌마다 벌금 1등을 달리고 있지. 체력이 저질이라 몇 개임 치면 힘들다고 함.   
    """

    prompt = PromptTemplate(
        input_variables=["question"],
        template=
        f"""{info}
        
탁구 전적 결과:
['2024.05.13', '한경만, 허동혁', '4', '₩1,000', '김상현, 김지훈']
['2024.05.13', '김상현, 김지훈', '5', '₩1,000', '박은규, 한경만']
['2024.05.13', '박은규, 한경만', '5', '₩1,000', '김지훈, 허동혁']
['2024.05.13', '김상현, 박은규', '5', '₩1,000', '김지훈, 허동혁']
['2024.05.14', '한경만, 허동혁', '4', '₩1,000', '김상현, 박은규']
['2024.05.14', '박은규, 허동혁', '4', '₩1,000', '김상현, 한경만']
['2024.05.17', '김지훈, 박은규', '3', '₩1,000', '김상현, 한경만']
['2024.05.17', '김상현, 한경만', '5', '₩1,000', '김지훈, 박은규']
['2024.05.17', '김상현, 한경만', '5', '₩1,000', '김지훈, 박은규']
['2024.05.17', '김상현, 박은규', '5', '₩1,000', '김지훈, 한경만']
['2024.05.17', '김지훈, 한경만', '4', '₩1,000', '김상현, 박은규']
['2024.05.17', '김상현, 김지훈', '4', '₩1,000', '박은규, 한경만']
['2024.05.17', '김상현, 박은규', '4', '₩1,000', '김지훈, 한경만']
['2024.05.20', '박은규, 허동혁', '5', '₩1,000', '김지훈, 한경만']
['2024.05.20', '김지훈, 허동혁', '3', '₩1,000', '김상현, 한경만']
['2024.05.21', '김지훈, 박은규', '5', '₩1,000', '김상현, 한경만']
['2024.05.21', '김지훈, 허동혁', '5', '₩1,000', '김상현, 박은규']
['2024.05.21', '김상현, 한경만', '4', '₩1,000', '김지훈, 허동혁']
['2024.05.22', '한경만, 허동혁', '5', '₩1,000', '김상현, 김지훈']
['2024.05.23', '박은규, 한경만', '2', '₩2,000', '김지훈, 허동혁']
['2024.05.23', '김지훈, 박은규', '4', '₩1,000', '한경만, 허동혁']
['2024.05.23', '김지훈, 박은규', '3', '₩1,000', '한경만, 허동혁']
['2024.05.24', '한경만, 허동혁', '3', '₩1,000', '김상현, 박은규']
['2024.05.24', '박은규, 허동혁', '1', '₩5,000', '김상현, 김지훈']
['2024.05.27', '김상현, 박은규', '5', '₩1,000', '한경만, 허동혁']
['2024.05.27', '김상현, 허동혁', '4', '₩1,000', '박은규, 한경만']
['2024.05.27', '김상현, 한경만', '6', '₩1,000', '김상현, 허동혁']
['2024.05.27', '김상현, 한경만', '6', '₩1,000', '박은규, 허동혁']
        ----------------
        Human: {question}
        """,
    )

    # chain을 만드는 데 code_prompt를 사용한다.
    chain = LLMChain(
        llm=llm,
        prompt=prompt
    )

    response = chain.invoke({"question": question})

    print(response)
